Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja6/jostein-n.html.tmx
Source language: nob
Languages: sme

source: Jeg siterer fra en støtteerklæring fra Alta lærerhøgskolelag som var basert på min innledning: «Utdanning av samiske lærere ved Alta lærerhøgskole vil alltid bli et tillegg til den norskspråklige – så lenge utdanninga skjer i et norsk språklig og kulturelt miljø, – så lenge institusjonen hovedsakelig er innrettet på å betjene grunnskoler i norskspråklige områder, – så lenge premissene for alt som skjer ved institusjonen angående det samiske samfunn ikke har samiske behov og interesser som utgangspunkt, men snarere det norske samfunnets/myndighetenes behov for å mestre det ‘det samiske problem’.
sme: Geardduhan dás Álttá oahpaheaddjiallaskuvlasearvvi doarjjasániid mas vuođđun lei mu álggahus: «Oahpaheaddjioahppu sámiid várás Álttá oahpaheaddjiallaskuvllas boahtá álot leat lassin dárogielat ohppui – nu guhká go lágiduvvo dárogielat ja -kultuvrralaš birrasis – nu guhká go ásahusa váldoulbmilin lea bálvalit vuođđoskuvllaid mat leat dárogielbirrasiin, – ja nu guhká go skuvlla barggus sámi servodaga ektui, eai leat sámiid iežaset dárbbut ja beroštumit vuolggasadjin, muhto baicca dáža servodaga/eisseválddiid dárbu hálddašit «sámi čuolmma».

source: En fullverdig samisk lærerutdanning er det bare mulig å utvikle innen det samiske kjerneområdet, på samiske premisser, i kontinuerlig kontakt med de samiske grunnskolelærerne».
sme: Dievaslaš sámi oahpaheaddjioahpu lea vejolaš ovddidit dušše sámi váldoguovlluin, sámi eavttuid mielde, ja guhkilmas oktavuođain sámi vuođđoskuvlla oahpaheddjiiguin».

source: På helleristningsfeltet i mai 1979, studenter på ettårig videreutdanning i samisk språk og kultur, fra venstre: Ellen Turi Guttormsen, Torunn Hætta, Gunnar Lile, Jon Meløy, Inger Tapio Lie, Ulf Thomassen, Magne Einejord, Herman Kåven og Arne Store fra NRK Finnmark.
sme: Báktegovvagiettis 1979 miessemánus, studeanttat geat lohke sámegiela ja -kultuvrra jagi joatkkaoahpu. Gurut bealde: Ellen Turi Guttormsen, Torunn Hætta, Gunnar Lile, Jon Meløy, Inger Tapio Lie, Ulf Thomassen, Magne Einejord, Herman Kåven ja Arne Store (NRK Finnmárku).

source: På helleristningsfeltet en septemberdag i 1983, 1/2-årig i samisk språk og kultur, fra venstre bak: Else Grethe Rasmussen (Broderstad), Berit Ranveig Iversen (Nilssen) Asbjørn Guttorm og Anne Olli sittende foran.
sme: Báktegovvagiettis 1983 čakčamánus, studeanttat geat lohke sámegiela ja -kultuvrra jahkebeali. Gurut bealde duohken: Else Grete Rasmussen (Broderstad), Berit Ranveig Iversen (Nilssen), ovddabealde: Asbjørn Guttorm, Anne Olli.

source: Egen samisk høgskole som mål
sme: Mihttun sierra sámi allaskuvla

source: Alle konfliktene rundt samisk avdeling førte til at det ble nedsatt et nytt utvalg med Anton Hoëm som leder, Hoëm II-utvalget.
sme: Buot dát riiddut sámi ossodaga birra dagahedje ahte ásahuvvui ođđa lávdegoddi man Anton Höem jođihii, Hoëm II -lávdegoddi.

source: Det regionale høgskolestyret ble pålagt av Kultur- og vitenskapsdepartementet i brev av 26.03.82 å utrede spørsmål «som knytter seg til samisk lærerutdanning på kort sikt».
sme: Kultur- ja dieđadepartemeanta gohčui Guovlulaš allaskuvlastivrra reivves beaiváduvvon 26.3.83, guorahallat gažaldagaid «mat čatnasit sámi oahpaheaddjiohppui lagamus áiggis».

source: Liv Østmo ble medlem av dette utvalget.
sme: Mearkkašahtti lei ahte Liv Østmo vulggii miellahttun dán lávdegoddái.

source: Odd Mathis Hætta var medlem av begge Hoëm – utvalgene og spilte en sentral rolle i oppbyggingen av Sámi Ossodat.
sme: Odd Mathis Hætta lei miellahttun goappašat Hoëm-lávdegottiin ja lea leamaš guovddáš olmmožin Sámi ossodaga huksemis.

source: Utvalget la fram sin innstilling 05.08.83.
sme: Lávdegoddi ovdanbuvttii evttohusas 05.08.83.

source: For Hoëm II-utvalget stod det nok klart at den samiske lærerutdanninga bare hadde blitt en samisk komponent i en altoverveiende norsk høgskole.
sme: Hoëm II -lávdegoddái gal lei čielggas ahte sámi oahpaheaddjioahppu lei šaddan dušše dakkár komponeantan dáža allaskuvllas.

source: Det var også klart at Sámi Ossodat ikke hadde fått status og ressurser til å fungere som en selvstendig avdeling.
sme: Lei maid čielggas ahte Sámi ossodat ii lean olahan stáhtusa iige resurssaid doaibmat sierra iehčanas ossodahkan.

source: Utvalget skisserer de langsiktige tiltaka på s. 65: Utvikle en samisk lærerutdanning ved Alta lærerhøgskole, samisk avdeling.
sme: Lávdegoddi hivvehallá guhkit áigge doaibmabijuid ná 65. siiddus: Ovddidit sámi oahpaheaddjioahpu Álttá oahpaheaddjiallaskuvlla sámi ossodahkii.

source: Etablere samisk avdeling ved Alta lærerhøgskole som en fullverdig avdeling med egen avdelingsleder.
sme: Ásahit Álttá oahpaheaddjiallaskuvlii sámi ossodaga, ollislaš ossodahkan, mas lea sierra ossodatjođiheaddji.

source: Flytte samisk avdeling og den samiske lærerutdanninga ut fra Alta lærerhøgskole som del av første fase i etablering av en egen samisk høgskole for lærerutdanning.
sme: Fárrehit sámi ossodaga ja sámi oahpaheaddjioahpu eret Álttá oahpaheaddjiallaskuvllas. Dát livččii vuosttaš oassi barggus sierra sámi allaskuvlla ásaheamis oahpaheaddjioahpu várás.

source: Bygge ut den samiske høgskole for lærerutdanning til også å omfatte andre utdanningsretninger på høgskolenivå.
sme: Viiddidit sámi allaskuvlla oahpaheaddjioahpuid várás, vai sáhtálii maid fállat oahpu eará oahpposurggiin allaskuvladásis.

source: Integrere denne høgskolen med andre nordiske enheter, slik at det kan etableres en felles nordisk vitenskapelig høgskole.
sme: Ovttastahttit dán allaskuvlla eará davviriikkalaš ásahusaiguin, vai sáhttá ásahit oktasaš davviriikkalaš dieđalaš allaskuvlla.

source: Det skulle enda gå 6 år før Sámi allaskuvla ble etablert i Guovdageaidnu i 1989.
sme: Galge vel vássit 6 jagi ovdal Sámi allaskuvla ásahuvvui Guovdageidnui, 1989:s.

source: Hadde ikke høgskolen kunnet overta Forsvaret sine lokaler, ville det tatt enda lenger tid.
sme: Jus allaskuvla ii lean sáhttit váldit badjelasas Suodjalusa visttiid, de gal lei ádjánit vel guhkit.

source: Leder i det regionale høgskolestyret i flere perioder, Ole K. Sara, spilte trolig en avgjørende rolle i etableringen av høgskolen.
sme: Máŋgga áigodaga jođiheaddji guovlulaš allaskuvlastivrras, Ole K. Sara, dáiddii leamaš guovddážis allaskuvlla ásaheamis.

source: Bak fra venstre: Odd Mathis Hætta, Liv Østmo, Eirik Sjømæling, Olav Daae. Foran fra venstre: Inga Ravna Eira, Anton Hoëm, Jule Eira, Kristian Berg Nilssen.
sme: Duogábealde: Odd Mathis Hætta, Liv Østmo, Eirik Sjømæling, Olav Daae Gurit bealde ovdábealde: Inga Ravna Eira, Anton Hoëm, Julie Eira, Kristian Berg Nilssen.

source: (Foto: Odd Mathis Hætta)
sme: (Govva: Odd Mathis Hætta)

source: Noen samiske studenters erfaringer
sme: Muhtin sámi studeanttaid vásáhusat

source: I løpet av skoleåret 2007/08 har jeg kontaktet seks av mine tidligere studenter for å høre hvordan de nå ser på erfaringene de gjorde som studenter på Alta lærerhøgskole på 1970-tallet.
sme: 2007/08 skuvlajagi válden oktavuođa guđain mu ovddeš studeanttain, gullandihtii movt sii dál oidnet daid vásáhusaid maid ožžo dalle go ledje studeantan Álttá oahpaheaddjiskuvllas 1970-logus.

source: Det var ressurssterke samiske ungdommer som søkte seg til ALH de første åra, og alle mine informanter har i dag fremtredende stillinger i yrkeslivet.
sme: Ledje nanu sámi nuorat mat ohce Álttá oahpaheaddjiskuvlii daid vuosttaš jagiid, ja buohkain mu informánttain leat dál alla virggit.

source: De er i dag alle i 50-åra og det er tre kvinner og tre menn.
sme: Sii leat dál 50-jagiin ja leat 3 nissonolbmo ja 3 dievdoolbmo.

source: Jeg har hatt alle som studenter i faget pedagogikk og alle jobbet for meg som intervjuere under prosjektet «Kautokeino-ungdom» (1974–77).
sme: Buohkat diet leat leamaš mu studeantan pedagogihkkafágas, ja buohkat barge mu ovddas jearahallanbargguid «Guovdageainnu nuorat»-prošeavtta oktavuođas (1974-1977).

source: En av mine informanter påpeker at 70-tallet var en oppvåkningstid for det samiske.
sme: Okta mu informánttain deattuha ahte 70-lohku lei dakkár morihanáigi sámiide.

source: Det skjedde en revitalisering.
sme: Dáhpáhuvai ealáskahttin.

source: Dermed ble det også en brytningstid som utløste motreaksjoner fra både etnisk norske og samer som hadde fortrengt sin samiske identitet og blitt helt assimilert i det norske samfunnet.
sme: Dasto šattai maid dakkár nuppástuhttináigi mii dagahii vuosttaldeami sihke etnalaš dážaid bealis ja sámiin geat oalát ledje hávkadan sin sámi identitehta ja oktiisuddan dáža servodahkii.

source: «Motstanden vi møtte gjorde at kravene vi stilte ble hardere, og at det ble en enorm utvikling.
sme: «Vuosteháhku maid vásiheimmet dagahii ahte bijaimet mihá garraset gáibádusaid, ja nu šattai ge nana ovdáneapmi.

source: Dette kom som et sjokk for mange av de norske studentene».
sme: Dát suorggahahttii sakka máŋgasa dain dáru studeanttain».

source: Mine 6 informanter har opplevd tida på ALH ulikt.
sme: Dát mu guhtta studeanta leat vásihan studeantaáiggi Álttá oahpaheaddjiskuvllas iešguđet ládje.

source: Viktige faktorer som påvirker opplevelsene og farger de personlige erfaringene er studentenes bakgrunn i forhold til bevissthet om egen etnisk identitet, engasjement i samiske spørsmål, forventninger til ALH og spesielt samisk avdeling, grad av integrering i samisk miljø i Alta, særlig Álttá sámiid searvi (ASS), noen få samiske familier i Alta og ikke minst student- og lærerfellesskapet på Samisk avdeling ved ALH.
sme: Dat mii eanemusat váikkuhii ja hábmii studeanttaid persovnnalaš vásáhusaid lei sin duogáš ja sin diđolašvuohta iežaset identitehta ektui, beroštupmi sámi áššiide ja vuordámušat oahpaheaddjiskuvlii ja sámi ossodahkii. Eará mii maid váikkuhii lei man muddui sii ledje mielde dahje oassin sámi birrasis Álttás, earenoamážit Álttá sámi searvvis, muhto maid soames sámi bearrašiin Álttás ja earenoamážit studeanta- ja oahpaheddjiid searvevuođas Álttá oahpaheaddjiskuvlla sámi ossodagas.

source: Studentene gir uttrykk for at de satte stor pris på lærerstaben og miljøet på samisk avdeling.
sme: Studeanttat muitalit ahte sii atne buorrin oahpaheddjiid ja birrasa mii lei sámi ossodagas.

source: De negative opplevelsene knyttes i det vesentlige dels til høgskolens manglende forståelse for å utvikle en samisk lærerutdanning, dels til lokalsamfunnet Alta og dels til en del norske lærere og studenter.
sme: Váivves vásáhusat čatnasedje sihke allaskuvlla váilevaš ipmárdussii sámi oahpaheaddjioahpu ovddideapmái, Álttá lagasbirrasii ja muhtin dáru oahpaheddjiide ja studeanttaide.

source: Alle mine informanter opplevde at de hadde en fast og trygg samisk identitet da de kom til Alta.
sme: Buot mu informánttat navde ahte sis lei nana ja oadjebas sámi identitehta dalle go bohte Áltái.

source: En informant var mer opptatt av idrett enn politikk og samisk politikk under ALH-tida.
sme: Okta informánta beroštii eambbo valáštallamis go politihkas ja sámi politihkas Álttá oahpaheaddjiskuvlla áiggis.

source: En annen sier at hun hadde en trygg samisk identitet innenfor sin egen familie, men hadde en enorm respekt for det norske.
sme: Okta iežá studeanta logai alddis nana sámi identitehta bearraša siskkobealde, muhto son anii hui alla árvvus dan mii dárrui gulai.

source: Hun hadde lært hjemme at skulle man fram i livet måtte man beherske norsk og det norske.
sme: Son lei oahppan ruovttus ahte jus áiggui olahit maide eallimis de ferte hálddašit sihke dárogiela ja buot mii dáža máilbmái gulai.

source: En påpeker at studentmiljøet var inkluderende, men at han visste om kystsamer som aldri sa at de var samer, men som han vet seinere har meldt seg inn i samemanntallet.
sme: Okta čujuha ahte studeantabiras lei hui fátmmasteaddji, muhto ahte son gal dovddai mearrasámiid geat eai goassege muitalan ahte ledje sápmelaččat. Son diehtá ahte sii leat maŋŋel čálihan iežaset sámi jienastuslohkui.

source: Med ett unntak hadde alle store forventninger til at de skulle få en samisk lærerutdanning.
sme: Earret ovttas sis, ledje buohkain sis stuora vuordámušat ahte galge oažžut sámi oahpaheaddjioahpu.

source: Det pekes på at en viktig del av begrunnelsen for å opprette Lærerutdanningen i Alta var å utdanne lærere til samiske områder.
sme: Čujuhuvvu dasa ahte dehálaš ággan ásahit Oahpaheaddjiskuvlla Áltái, lei ahte galge oahpahit oahpaheddjiid sámi guovlluide.

source: Ønske om å få kompetanse til å undervise i samiske områder ble bare oppfylt på samisk avdeling.
sme: Sávaldat háhkat gelbbolašvuođa oahpahit sámi guovlluin, ollašuvai dušše sámi ossodagas.

source: I tillegg til samisk språk, kultur og historie, ble også didaktikk, metodikk og generell pedagogikk for samiske områder etterlyst.
sme: Lassin sámegillii, -kultuvrii ja -historjái, de ohcaledje maid oahpu didaktihkas, metodihkas ja dábálaš pedagogihkas mii livččii heivehuvvon sámi guovlluide.

source: Det hevdes at det i 1973 ikke ble avertert etter folk som kunne undervise i og på samisk.
sme: Čuoččuhuvvo ahte 1973:s ii oba ohccojuvvon ge oahpaheaddji gii livččii máhttán oahpahit sámegiela ja sámegillii.

source: Overgangen fra samiske lokalsamfunn til det overveiende norske tettstedet Alta opplevdes ganske forskjellig.
sme: Studeanttat vásihedje sirdima sámi lagasbirrasis dievas dáža birrasii Áltái iešguđet ládje.

source: Det påpekes at holdningen fra lokalsamfunnet var motsetningsfull.
sme: Sii vávje ahte ledje olu vuostálasvuođat lagasbirrasa guottuin.

source: Det var rolig så lenge man ikke nevnte noe om det samiske, «men vi som tona det samiske flagget fikk merke det.
sme: Lei jaskat nu guhká go ii oktage fal jietnadan maidege sápmái guoskevaš áššiid birra, «muhto mii geat ceggiimet sámi leavgga, gal beasaimet mearkkašit dan.

source: Vi ble betegna som ekstremister og ČSV-ere.
sme: Min navde ekstremistan ja ČSV-an.

source: Vi var usikre på vår identitet, vi hadde minst to identiteter.
sme: Mii leimmet eahpesihkkarat iežamet identitehtas, mis ledje unnimusat guokte identitehta.

source: Hjemmeidentiteten kunne vi ikke forfekte i Alta-miljøet».
sme: Ruovttuidentitehtamet eat sáhttán rámpot Álttá-birrasis».

source: En annen opplevde det som strevsomt, og følte hun ikke ble inkludert av Alta-folk.
sme: Okta iežá ges vásihii dán lossadin, iige orron iežas mielas váldome searvái Álttá olbmuid gaskkas.

source: Men hun ble kjent med noen samer fra Alta, for eksempel familien Sara på Kronstad.
sme: Muhto son goit oahpásnuvai soames sápmelaččaide geat orro Álttás, ee. Sara-bearrašii geat orro Kronstadas.

source: En kjente Alta fra før, og overgangen var som forventet: «Jeg hadde mest kontakt med medstudenter».
sme: Muhtun eará fas lei oahpis Álttás ja šattai sullii nu go lei vuordán: «Mus lei eanemus oktavuohta mielstudeanttaiguin».

source: En annen fikk mange bekjentskaper gjennom vertsfamilien.
sme: Okta eará fas oahpásnuvai oallugiidda verddebearraša bokte.

source: Jeg stilte spørsmålet om det var arenaer i Alta for å ivareta den samiske identiteten.
sme: Jerren lei go Álttás arena mii vuhtiiválddii sámi identitehta.

source: Her viser det seg Álttá Sámiid Searvi (ASS) hadde en meget stor betydning: 5 av 6 nevner ASS som den viktigste og omtrent eneste samiske arenaen i lokalsamfunnet: «ASS hadde stor betydning for ALH og studentene.
sme: Čájehuvvui ahte Álttá sámi searvi lei hui mávssolaš: viđas guđa studeanttas dadje ahte Álttá sámi searvi lei dehálaččamus ja measta áidna sámi arenaid dien lagasservodagas: «Álttá sámi searvi mearkkašii olu Álttá oahpaheaddjiskuvlii ja studeanttaide.

source: Styret i ASS brakte studentenes røst videre til blant annet Edel Hætta Eriksen.
sme: Álttá sámi searvvi stivra doalvvui viidáset studeanttaid sága ee. Edel Hætta Eriksenii.

source: Studentene søkte trygghet i ASS/NSR, den var studentenes egen og eneste arena.
sme: Studeanttat ohce dorvvu Álttá sámi searvvis ja NSR:s, mii lei studeanttaid iežaset ja áidna arena.

source: Den var premissleverandør og hadde samme funksjon som Sametinget i dag».
sme: Dat lei dat mii bijai eavttuid ja das lei dalle seamma doaibma go sámedikkis lea dál».

source: Edel Hætta Eriksen var i en lengre periode direktør for Samisk utdanningsråd, etablert i 1976.
sme: Edel Hætta Eriksen lei guhká Sámi oahpahusráđi jođiheaddji, mii ásahuvvui 1976.

source: ASS utgjorde også en viktig og positiv kontakt med lokalbefolkningen.
sme: [4] Álttá sámi searvi doalai dehálaš ja buori oktavuođa báikegotti olbmuiguin.

source: De fleste informantene nevner også studentfellesskapet og fellesskapet på Samisk avdeling.
sme: Eanas informánttat maid namuhit studeanttabirrasa ja sámi ossodaga birrasa.

source: En av informantene satt i styret i ASS, og var med på å stifte Samisk studentforbund, som også ble en viktig intern arena.
sme: Okta informánttain čohkkái Álttá sámi searvvi stivrras, ja lei mielde ásaheamen Sámi studeantalihtu, mii maid šattai dehálaš siskkáldas arenan.

source: Jeg spurte om studentene under studieperioden ble utsatt for diskriminering eller rasisme i Alta-samfunnet.
sme: Mun jerren studeanttain ahte vásihedje go Álttá servodaga bealis rasismma dahje vealaheami, dalle go vázze Álttás oahpu.

source: En informant bruker begrepet uteglemt: «Ikke direkte diskriminering, men kanskje heller at det samiske hele tida ble uteglemt både på skolen og ellers i samfunnet.
sme: Okta informánttain geavaha doahpaga vajálduvvan: «Ii njuolgut vealaheami, muhto baicca ahte dat sámevuohta álo vajálduvai sihke skuvllas ja muđui servodagas.

source: For eksempel det med samiske barnehager, samisk språk på skolen etc. Det var hele tiden en kamp man måtte drive med for å beholde språket hos egne barn.
sme: Ovdamearkka dihte sámi mánáidgárdi, sámegiella skuvllas jna. Diet lei álo dakkár soahti maid šattai soahtat jus galggai seailluhit sámegiela mánástis.

source: Også på høgskolen måtte vi hele tiden kjempe for å få mer samisk språk og samiske emner i andre fag enn samiskfaget».
sme: Maiddái allaskuvllas fertiimet álohii rahčat vai oččoleimmet eanet sámegiela ja sámi fáttáid eará fágain go sámegielfágas».

source: En annen sier at «det var nok noen bemerkninger når jeg snakket samisk med barna mine eller med medstudenter».
sme: Muhtun iežá lohká ná: «dat ledje gal cuiggodeamit go hupmen sámegiela mánáidanguin dahje mielstudeanttaiguin».

source: En opplevde holdningene fra lokalsamfunnet som motsetningsfulle, som påpekt ovenfor.
sme: Okta vásihii ahte lagasservodaga guottut ledje hui vuostá dan sámevuođa, nugo ovdalis namuhuvvon.

source: Det var ro så lenge det samiske ikke ble markert.
sme: Lei ráfálaš nu guhká go sámevuohta ii oidnon iige gullon.

source: Men ved bruk av samiske klesplagg som for eksempel, altså markering av det samiske, opplevde en informant rasisme med negative tilrop.
sme: Muhto dakkaviđe go sámi biktasiid coggá badjelasas, ovdamearkka dihte luhka, nappo sámevuođa čájehedje, de vásihii goit okta informánttain rasismma ja váivves čuorvumiid.

source: To informanter kan ikke huske å ha opplevd rasisme, for som den ene sier: «Men jeg var jo heller ikke helt ytterst på barrikadene for det samiske».
sme: Guokte informántta lohkaba ahte eaba muitte vásihan rasismma, dehe nu go dat nubbi dadjá: «Muhto in mun leange njunnošis sámevuođa ovddideame.»

source: Jeg spurte om hvilke tilbud studentene fikk på samisk språk og om samisk språk, kultur og historie: «Vi måtte kjempe for å få tilbud i og på samisk; måtte bevise at vi hadde krav på dette.
sme: Jerren makkár fálaldaga studeanttat ožžo sámegillii, ja sámegiela, kultuvrra ja historjjá birra: «Mii fertiimet rahčat vai oaččuimet sámegielfálaldaga, sihke sámegillii ja sámegiela birra, fertiimet duođaštit ahte mis lei gáibádus dasa.

source: Men skolens begrunnelse var jo nettopp å utdanne for samiske områder (og grisgrendte strøk).
sme: Muhto skuvlla ágga lei ahte sii galgege oahpahit olbmuid sámi guovlluide (ja boaittobealbáikkiide).

source: Hadde vi ikke protestert hadde vi blitt utdannet til å fornorske de samiske områdene.
sme: Jus eat livčče mannan vuostá dien de livččiimet oahpahuvvon dáruiduhttit sámi guovlluid.

source: Kjærligheten og følelsene for det samiske var så sterk».
sme: Ráhkisvuohta ja dovddut sámevuhtii ledje nu nannosat.

source: Undervisningen på samisk foregikk den første tida på ettermiddags- og kveldstid og til dels i et kjellerlokale uten vinduer.
sme: » Sámegieloahpahus lei dan vuosttaš áiggi maŋŋelgaskabeivviid ja eahkediid. Muhtumin lei dat muhtun geallerlanjas gos eai lean láset ge.

source: Undervisning på samisk forekom bare i samisk språk og historie og en del emner innen pedagogikk.
sme: Oahpahus sámegillii lei dušše sámegielfágas ja historjjás, ja muhtun fáttát pedagogihkas.

source: «Av og til gjesteforelesere i pedagogikk.
sme: «Muhtumin lei guosselogaldalli pedagogihkas.

source: Vår ped. lærer Jostein Hansen leide av og til inn Jan Henry Keskitalo på emner i pedagogikk».
sme: Min pedagogihka oahpaheaddji Jostein Hansen láigohii muhtumin Jan Henry Keskitalo soames fáttáid oahpahit pedagogihkas.

source: Undervisning om samisk språk, kultur og historie foregikk i det alt vesentlige på samisk avdeling.
sme: Oahpahus sámegiela, kultuvrra ja historjjá birra lei eanas áigge sámi ossodagas.

source: Men det fantes unntak: «Det jeg kan huske er at ped. læreren (Jostein Hansen) var meget dyktig til å integrere samisk problematikk inn i fagstoffet og relatere dette til situasjoner som vi kunne kjenne oss igjen i og problematisere.
sme: Earretgo dán fearána: «Dan maid mun sáhtán muitit lei ahte pedagogihka oahpaheaddji (Jostein Hansen) lei čeahppi váldit mielde sámi čuolmmaid fágaáššiide ja bidjat daid dakkár dilálašvuhtii mii midjiide lei oahpis ja maid sáhtiimet suokkardallat.

source: Kanskje noe av grunnen til at jeg husker dette så godt, er at de ikke-samiske studentene la opp til formelle protester mot denne læreren.
sme: Soaittán muitit dán nu bures, danin go muhtun studeanttat geat eai lean sámit, vuosttaldedje dán oahpaheaddji vuostá formálalaččat.

source: Dette førte faktisk til at vedkommende ble skiftet ut.
sme: Dát mielddisbuvttii ahte dien oahpaheaddji lonuhedje earáin.

source: Jeg husker det også like godt at alle de samiske studentene var uenige i dette og fremmet det overfor skolen.
sme: Muittán lihka bures ahte ii oktage sámi studeanttain lean dása mielas ja ovddidii dan skuvlla ovdii.

source: Denne handlingen var vel det nærmeste man kunne kalle for ‘rasisme’».
sme: Diet dáiddii lean dat lagamus maid sáhtálii gohčodit ‘rasisman’.

source: En konsekvens av denne motstanden fra norske studenter ble etter hvert at de samiske studentene ble mer permanent organisert som en egen enhet utenfor klassen.
sme: » Boađusin dáža studeanttaid vuosttaldeamis lei ahte áiggi mielde šadde sámi studeanttat organiserejuvvot oalát sierra ovttadahkan olggobeallái luohká.

source: Denne informanten er nøye med å understreke at det var unntak blant de norske studentene som «absolutt hadde forståelse for den flerkulturelle virkelighet samfunnet var omgitt av».
sme: Dát informánta deattuha nannosit ahte eai buot dáža studeanttat lean seammalágánat, ja muhtumat «gal duođaš ipmirdedje dan máŋggakultuvrralaš duohtavuođa mii lei min servodagas».

source: En annen informant sier hun skrev om samiske temaer i pedagogikk, men dette ble avvist av lærerne som ikke-eksisterende.
sme: Okta iežá studeanta muitala ahte son čálii sámi fáttáid birra pedagogihkas, muhto oahpaheaddji ii atnán dan maninge.

source: Og i samme gate ligger følgende svar: «Ellers pleide vi samiske studenter selv å spørre foreleserne om det samiske, og det opplevde jeg ofte at man ikke riktig likte.
sme: Ja lea vel okta sullásaš vástádus: «Muđui láviimet mii sámi studeanttat ieža jearrat logaldalliin sámi birra, muhto dan gal viguimet ahte dasa dat eai riekta liikon.
